# BuiltInFailures.ViewFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures Class
BuiltInFailures Class Members See Also
---
Failures about ViewFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ViewFailures
```

Visual Basic
---
```text
Public NotInheritable Class ViewFailures
```

Visual C++
---
```text
public ref class ViewFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ViewFailures
# See Also
BuiltInFailures..::..ViewFailures Members
Autodesk.Revit.DB Namespace